microchip-pic-avr-examples/dspic33ck-power-dcdc-dual-active-bridge-development-platform/dab-pwm-configuration.X/sources/device/pwrctrl/dev_pwrctrl_pwm.c
/* Microchip Technology Inc. and its subsidiaries.  You may use this software 
 * and any derivatives exclusively with Microchip products. 
 * 
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS".  NO WARRANTIES, WHETHER 
 * EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED 
 * WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND FITNESS FOR A 
 * PARTICULAR PURPOSE, OR ITS INTERACTION WITH MICROCHIP PRODUCTS, COMBINATION 
 * WITH ANY OTHER PRODUCTS, OR USE IN ANY APPLICATION. 
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, 
 * INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND 
 * WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS 
 * BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE 
 * FULLEST EXTENT ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS 
 * IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF 
 * ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * MICROCHIP PROVIDES THIS SOFTWARE CONDITIONALLY UPON YOUR ACCEPTANCE OF THESE 
 * TERMS. 
 */

#include <xc.h> 
#include <stdbool.h>
#include "pwm_hs/pwm.h"
#include "dev_pwrctrl_typedef.h"

/*******************************************************************************
 * @ingroup dev-pwrctrl-pwm-methods-public
 * @brief  PWM distribution for DAB converter
 * @param  pcInstance  Pointer to a power control data object of type POWER_CONTROL_t
 * @return void
 * 
 * @details This function distributes the calculated control phase for the 
 *  half bridges of the DAB converter. PWM1 and PWM3 drives the primary half 
 *  bridges and PWM2 and PWM4 drives the secondary half bridges.
 *********************************************************************************/
void Dev_PwrCtrl_PWM_Update(POWER_CONTROL_t* pcInstance)
{   
     // The PWM Period bits [2:0] needs to be mask when using cascaded PWM setup 
    // (please refer to Section 4.1.3.3 in High Resolution PWM FRM)
    uint16_t PeriodMask = 0x7; 
    
    // Mask the calculated frequency bits [2:0] to make the cascaded/synchronous
    // PWM scheme reliable (please refer to Section 4.1.3.3 in High Resolution PWM FRM)
    pcInstance->Pwm.ControlPeriod = pcInstance->Pwm.ControlPeriod & ~(PeriodMask);
    
    // calculate Duty Cycle for 50%
    pcInstance->Pwm.ControlDutyCycle = (pcInstance->Pwm.ControlPeriod >> 1);

    // Maximum Clamping for control phase
    if(pcInstance->Pwm.ControlPhase > pcInstance->Pwm.ControlPeriod){
        pcInstance->Pwm.ControlPhase = pcInstance->Pwm.ControlPeriod;
    }

    // Calculate primary to secondary phase as half of the control phase
    uint16_t PrimarySecondaryPhase = (pcInstance->Pwm.ControlPhase >> 1);
    
    // Calculate the bridge delay ((Frequency / 2) - Primary to Secondary Phase + Control Phase)
    // Note that in the cascaded PWM, the reference phase of the client PWM, is its trigger source
    uint16_t PrimaryPhaseDelay = (pcInstance->Pwm.ControlDutyCycle - PrimarySecondaryPhase) + 
            pcInstance->Pwm.ControlPhase;
    
    // Set the PWM trigger with the calculated PWM phases
    PWM_TriggerCCompareValueSet(pcInstance->Pwm.Primary_1, PrimarySecondaryPhase);
    PWM_TriggerCCompareValueSet(pcInstance->Pwm.Secondary_1, PrimaryPhaseDelay);
    PWM_TriggerCCompareValueSet(pcInstance->Pwm.Primary_2, PrimarySecondaryPhase);

    // Set the PWM Duty Cycle at 50% with the given Frequency
    PWM_DutyCycleSet(pcInstance->Pwm.Primary_1, pcInstance->Pwm.ControlDutyCycle);
    PWM_DutyCycleSet(pcInstance->Pwm.Secondary_1, pcInstance->Pwm.ControlDutyCycle);
    PWM_DutyCycleSet(pcInstance->Pwm.Primary_2, pcInstance->Pwm.ControlDutyCycle);
    PWM_DutyCycleSet(pcInstance->Pwm.Secondary_2, pcInstance->Pwm.ControlDutyCycle);
    
    // Set the PWM Frequency
    PWM_PeriodSet(pcInstance->Pwm.Primary_1, pcInstance->Pwm.ControlPeriod);
    PWM_PeriodSet(pcInstance->Pwm.Secondary_1, pcInstance->Pwm.ControlPeriod);
    PWM_PeriodSet(pcInstance->Pwm.Primary_2, pcInstance->Pwm.ControlPeriod);
    PWM_PeriodSet(pcInstance->Pwm.Secondary_2, pcInstance->Pwm.ControlPeriod);

    // Set the PWM High and Low DeadTime
    // DeadTime parameter added for testing
//    PWM_DeadTimeLowSet(pcInstance->Pwm.Primary_1, pcInstance->Pwm.DeadTimeLow);
//    PWM_DeadTimeLowSet(pcInstance->Pwm.Secondary_1, pcInstance->Pwm.DeadTimeLow);
//    PWM_DeadTimeLowSet(pcInstance->Pwm.Primary_2, pcInstance->Pwm.DeadTimeLow);
//    PWM_DeadTimeLowSet(pcInstance->Pwm.Secondary_2, pcInstance->Pwm.DeadTimeLow);
    
    // DeadTime parameter added for testing
//    PWM_DeadTimeHighSet(pcInstance->Pwm.Primary_1, pcInstance->Pwm.DeadTimeHigh);
//    PWM_DeadTimeHighSet(pcInstance->Pwm.Secondary_1, pcInstance->Pwm.DeadTimeHigh);
//    PWM_DeadTimeHighSet(pcInstance->Pwm.Primary_2, pcInstance->Pwm.DeadTimeHigh);
//    PWM_DeadTimeHighSet(pcInstance->Pwm.Secondary_2, pcInstance->Pwm.DeadTimeHigh);
    
    // Set the Update bit of the last PWM in the cascaded approach to broadcast
    // it to the other PWMs
    PWM_SoftwareUpdateRequest(pcInstance->Pwm.Secondary_2);
    
}

/*******************************************************************************
 * @ingroup dev-pwrctrl-pwm-methods-public
 * @brief  Enable the PWM output
 * @param  pcInstance  Pointer to a power control data object of type POWER_CONTROL_t 
 * @return void
 * 
 * @details This function turn on the physical PWM outputs by clearing the
 *  output override of the PWM module. 
 *********************************************************************************/
void Dev_PwrCtrl_PWM_Enable(POWER_CONTROL_t* pcInstance)
{
        
    // Turn-On PWM outputs by disabling the output override 
    // on each high and low PWM output
    PWM_OverrideHighDisable(pcInstance->Pwm.Primary_1);
    PWM_OverrideHighDisable(pcInstance->Pwm.Primary_2);
    PWM_OverrideHighDisable(pcInstance->Pwm.Secondary_1);
    PWM_OverrideHighDisable(pcInstance->Pwm.Secondary_2);
           
    PWM_OverrideLowDisable(pcInstance->Pwm.Primary_1);
    PWM_OverrideLowDisable(pcInstance->Pwm.Primary_2);
    PWM_OverrideLowDisable(pcInstance->Pwm.Secondary_1);
    PWM_OverrideLowDisable(pcInstance->Pwm.Secondary_2); 

    // Set update request of the last PWM in the cascade 
    // to update all pwm registers
    PWM_SoftwareUpdateRequest(pcInstance->Pwm.Secondary_2);

}


/*******************************************************************************
 * @ingroup dev-pwrctrl-pwm-methods-public
 * @brief  Disable the PWM output
 * @param  pcInstance  Pointer to a power control data object of type POWER_CONTROL_t
 * @return void
 * 
 * @details This function disable the physical PWM output by setting the override
 *  bits of the PWM module.
 *********************************************************************************/
void Dev_PwrCtrl_PWM_Disable(POWER_CONTROL_t* pcInstance)
{   
    // Turn-Off PWM outputs by enabling the output override 
    // on each high and low PWM output
    PWM_OverrideHighEnable(pcInstance->Pwm.Primary_1);
    PWM_OverrideHighEnable(pcInstance->Pwm.Primary_2);
    PWM_OverrideHighEnable(pcInstance->Pwm.Secondary_1);
    PWM_OverrideHighEnable(pcInstance->Pwm.Secondary_2);
           
    PWM_OverrideLowEnable(pcInstance->Pwm.Primary_1);
    PWM_OverrideLowEnable(pcInstance->Pwm.Primary_2);
    PWM_OverrideLowEnable(pcInstance->Pwm.Secondary_1);
    PWM_OverrideLowEnable(pcInstance->Pwm.Secondary_2); 
    
    // Set update request of the last PWM in the cascade 
    // to update all pwm registers
    PWM_SoftwareUpdateRequest(pcInstance->Pwm.Secondary_2);
    
}
